/*=======================================================================
 *Subsystem:   裸机
 *File:        ADC.c
 *Author:      WenMing
 *Description: 接口
               总压检测PAD0
               霍尔传感器：PAD03
               分流器：PAD10
               采样频率：2MHz
 ========================================================================
 * History:        // 修改历史记录列表，每条修改记录应包括修改日期、修改者及修改内容简述
 * 1. Date:
      Author:
      Modification:
========================================================================*/
#include"ADC.h"

/*=======================================================================
 *函数名:      ADC_init
 *功能:        初始化ADC
 *参数:        无         
                      
 *返回：       无
 *说明：       ADC 时钟频率：2MHz
========================================================================*/


void ADC_init(void) 
{
 ATD0CTL2 = 0x40;  //启动A/D模块,快速清零,禁止中断
 ATD0CTL1_SRES=2;  //选用12位模数转换
 ATD0CTL3 = 0x88;   //每次只转换一个通道
 ATD0CTL4 = 0xe1;   //AD模块时钟频率为2MHz
} 



/*=======================================================================
 *函数名:      ADCValue()
 *功能:        1路A/D转换函数，获取通道channel的转换结果
 *参数:        channel：通道号（0~15）         
                      
 *返回：       ADdata:channel通道的转换结果
 *说明：       ADC 时钟频率：2MHz
========================================================================*/
uint16 ADCValue(uint8 channel) 
{
  uint16 ADdata;
  uint16 i ;
  
  //Task_Die |=0x00001000;
  //Task_Die &=0xFFFFEFFF; 
  
  ATD0CTL5 = channel;
  for(;;) 
  {
    
     if((ATD0STAT0 & (1 << 7)) != 0)
     {          
        ADdata = ATD0DR0; 
        break;
     }  
  }

  //Task_Die &=0xFFFFEFFF;  

  return ADdata;
}
