/*=======================================================================
 *Subsystem:   裸机
 *File:        Task_VoltTempCollect.c
 *Author:      WenM
 *Description: 此源文件主要是将6811底层采集函数进行封装成应用函数
 ========================================================================
 * History:    修改历史记录列表
 * 1. Date:
      Author:
      Modification:
========================================================================*/
#include  "includes.h"
          
/*=======================================================================
 *函数名:      Task_VoltCMDSend(void)
 *功能:        LTC6811采集电压前发送的命令(启动ADC转换)
 *参数:        无       
 *返回：       无
 *说明：       LTC6811采集电压前发送的命令
========================================================================*/
void Task_VoltCMDSend(void)
{
   LTC6811_VoltCMDSend();
   
   g_Roll_Tick.Roll_VoltCMD++;
}
/*=======================================================================
 *函数名:      Task_VoltCollect(void)
 *功能:        LTC6811采集电压发送的读命令和读数据寄存器
 *参数:        无       
 *返回：       无
 *说明：       LTC6811采集电压前发送的命令
========================================================================*/
void Task_VoltCollect(void)
{
   LTC6811_VoltCollect(); 
   g_Roll_Tick.Roll_VoltCol++;
}
/*=======================================================================
 *函数名:      Task_TempCMDSend(void)
 *功能:        LTC6811采集温度前发送的启动ADC转换
 *参数:        无       
 *返回：       无
 *说明：       LTC6811采集温度前发送的启动ADC转换
========================================================================*/
void Task_TempCMDSend(void)
{
   LTC6811_TempCMDSend();
   
   g_Roll_Tick.Roll_TempCMD++;
}
/*=======================================================================
 *函数名:      Task_TempCollect(void)
 *功能:        LTC6811采集温度,写读命令,读GPIO数据寄存器
 *参数:        无       
 *返回：       无
 *说明：       LTC6811采集温度,写读命令,读GPIO数据寄存器
========================================================================*/
void Task_TempCollect(void)
{
   LTC6811_TempCollect();
   
   g_Roll_Tick.Roll_TempCol++;
}
/*=======================================================================
 *函数名:      Task_ChipTempCMDSend(void)
 *功能:        LTC6811采集芯片温度前发送的启动ADC转换
 *参数:        无       
 *返回：       无
 *说明：       LTC6811采集芯片温度前发送的启动ADC转换
========================================================================*/
void Task_ChipTempCMDSend(void)
{
   LTC6811_ChipTempCMDSend();
}
/*=======================================================================
 *函数名:      Task_ChipTempCMDSend(void)
 *功能:        LTC6811采集芯片温度前发送的启动ADC转换
 *参数:        无       
 *返回：       无
 *说明：       LTC6811采集芯片温度前发送的启动ADC转换
========================================================================*/
void Task_ChipTempCollect(void)
{
   LTC6811_ChipTempCollect();
}
/*=======================================================================
 *函数名:      Task_OpenWireDetect(void)
 *功能:        LTC6811进行导线开路的检测
 *参数:        无       
 *返回：       无
 *说明：       LTC6811进行导线开路的检测
========================================================================*/
void Task_OpenWireDetect(void) 
{
  LTC6811_OpenwireDetect();
  g_Roll_Tick.Roll_OpWire++;
}
