/*=======================================================================
 *Subsystem:   裸机
 *File:        main.C
 *Author:      Wenm
 *Description: 通信：
               接口：
               波特率：
 ========================================================================
 * History:    修改历史记录列表
 * 1. Date:    
      Author:  
      Modification:          
========================================================================*/
#include "Includes.h" 

/*=======================================================================
 *函数名:      主函数函数
 *功能:        1.系统初始化；
               2.任务函数的创建，
               3.任务的轮询
 *参数:        无 
 *返回：       无
 *说明：       包含各个初始化和任务的执行
========================================================================*/  
void main(void) 
{         
  Init_Sys();      //系统初始化(包括物理层初始化和数据初始化)  
  for(;;) 
  {
     Task_Handle();//任务轮询 
  } 
}
