/*=======================================================================
 *Subsystem:   裸机
 *File:        Init_IIC.C
 *Author:      WenYuhao
 *Description: 通信：
               接口：
               波特率：
 ========================================================================
 * History:    修改历史记录列表
 * 1. Date:
      Author:
      Modification:
========================================================================*/
#include  "includes.h"
/*=======================================================================
 *函数名:      Init_PLL(void)
 *功能:        调用底层PLL_Init初始化PLL
 *参数:        无       
 *返回：       无
 
 *说明：       
========================================================================*/
uint8 Init_IIC(void)
{
  uint8 state=0;
  
  IIC_SCL_dir  = 1; //IIC使能开关
  IIC_SDA_dir  = 1;
  IIC_SCL      = 1;
  IIC_SDA      = 1;
  
  state = IIC_Init();
  return state;
}