/*=======================================================================
 *Subsystem:   裸机
 *File:        Init_ADC.c
 *Author:      WenYuhao
 *Description: 
 ========================================================================
 * History:        // 修改历史记录列表，每条修改记录应包括修改日期、修改者及修改内容简述
 * 1. Date:
      Author:
      Modification:
========================================================================*/
#include  "includes.h"

/*=======================================================================
 *函数名:      Init_ADC(void)
 *功能:        初始化ADC
 *参数:        无         
 *返回：       state:ADC初始化的结果  0:通过  1:失败

 *说明：       
========================================================================*/
uint8 Init_ADC(void)
{
  uint8 state;
  state = ADC_init();
  return(state);
}